app/controllers/images_controller.rb

  def create
    @user = User.find(params[:user_id])
    @image = @user.images.build(params[:image])
    if @image.save
---
INSERT INTO "images" ("title", "url") VALUES ($1, $2) RETURNING "id"  [["title", nil], ["url", nil]]

  def show
    @image = Image.find(params[:id])
---
SELECT "images".* FROM "images" WHERE "images"."id" = $1 LIMIT 1  [["id", "16"]]