app/controllers/users_controller.rb

  def create
   unless params[:user][:password].empty?
      @user = User.new(params[:user])
      @user.save
---
INSERT INTO "users" ("created_at", "name", "password", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 21 Feb 2014 01:38:51 UTC +00:00], ["name", "something"], ["password", "password"], ["updated_at", Fri, 21 Feb 2014 01:38:51 UTC +00:00]]